<details><summary>tf plan:</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/app/app/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/app/app

To view this run in a browser, visit:
https://app.terraform.io/app/wspieramprzyrode/app/runs/run-GLhbjr7RJufq6Nz3

Waiting for the plan to start...

Terraform v0.12.25
Configuring remote state backend...
Initializing Terraform configuration...
2020/05/22 05:42:12 [DEBUG] Using modified User-Agent: Terraform/0.12.25 TFC/c6d59bd658
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

cloudflare_zone.dns_zone: Refreshing state... [id=e7a0b3ef45073d63cf619df176888e35]
cloudflare_record.docs_dns_record: Refreshing state... [id=e450de5fcf6c56e2b3f6c725d3a3481d]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.cluster will be created
  + resource "digitalocean_kubernetes_cluster" "cluster" {
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (sensitive value)
      + name           = "wspieramprzyrode"
      + region         = "fra1"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + tags           = (known after apply)
      + updated_at     = (known after apply)
      + version        = "1.17.5-do.0"
      + vpc_uuid       = (known after apply)

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = true
          + id                = (known after apply)
          + max_nodes         = 3
          + min_nodes         = 1
          + name              = "workers"
          + nodes             = (known after apply)
          + size              = "s-1vcpu-2gb"
          + tags              = (known after apply)
        }
    }

  # digitalocean_project.do_project will be created
  + resource "digitalocean_project" "do_project" {
      + created_at  = (known after apply)
      + environment = "Development"
      + id          = (known after apply)
      + is_default  = (known after apply)
      + name        = "wspieramprzyrode"
      + owner_id    = (known after apply)
      + owner_uuid  = (known after apply)
      + purpose     = "Web Application"
      + resources   = (known after apply)
      + updated_at  = (known after apply)
    }

  # digitalocean_project_resources.do_project_resources will be created
  + resource "digitalocean_project_resources" "do_project_resources" {
      + id        = (known after apply)
      + project   = (known after apply)
      + resources = (known after apply)
    }

  # digitalocean_tag.cluster_tag will be created
  + resource "digitalocean_tag" "cluster_tag" {
      + id   = (known after apply)
      + name = "wspieramprzyrode-k8s"
    }

  # digitalocean_tag.project_tag will be created
  + resource "digitalocean_tag" "project_tag" {
      + id   = (known after apply)
      + name = "wspieramprzyrode"
    }

  # helm_release.metrics-server will be created
  + resource "helm_release" "metrics-server" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.11.1"
      + wait                       = true

      + set {
          + name  = "args[0]"
          + value = "--kubelet-insecure-tls"
        }
      + set {
          + name  = "args[1]"
          + value = "--kubelet-preferred-address-types=InternalIP"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>